In [1]:
import sqlite3
import pandas as pd

conn = sqlite3.connect(r"C:\Users\Abhishek\sqlite\internship.db")

query = """
        SELECT interns.id,mentors.mentor_id
        FROM interns 
        INNER JOIN mentors 
        ON interns.id = mentors.mentor_id
        """

df = pd.read_sql_query(query,conn)
df

   id  mentor_id
0   1          1
1   2          2
2   3          3
3   4          4
4   5          5
5   6          6

In [2]:
query = """
        SELECT * FROM interns;
        """

df = pd.read_sql_query(query,conn)
df

   id    name               track  stipend
0   1    Abhi      Data Scientist    15000
1   2    Akhi       Web Developer    10000
2   3     Avi    Software Analyst     5000
3   4    hemu  associate Engineer     3000
4   5   Kumya    Python Developer     8000
5   6  sharat        Data Science     6000
6   9   shiva        Data Science     4000
7   7    manu        Data Science     9000
8   8    daya        Data Science    10000

In [3]:
query = """
        SELECT * FROM mentors;
        """

df = pd.read_sql_query(query,conn)
df

   mentor_id mentor_name               track
0          1       Rahul      Data Scientist
1          2       Anita       Web Developer
2          3       Kiran    Software Analyst
3          4      Ramesh  associate Engineer
4          5        Sita    Python Developer
5          6       Arjun        Data Science